const skillsOptions: any[] = [];

for (let i = 0; i < 5; i++) {
  skillsOptions.push({
    className:
      "bg-[rgba(236,_242,_255,_1)] rounded-[28px] flex items-center text-[18px]",
    label: `المهارة ${i}`,
    value: `skill ${i}`,
  });
}
const servicesOptions: any[] = [];

for (let i = 0; i < 5; i++) {
  let nestedServices = [];
  for (let ii = 0; ii < 5; ii++) {
    nestedServices.push({
      label: `الخدمة ${ii}`,
      value: `service ${Math.random()}`,
      key: `${Math.random()}`,
    });
  }
  servicesOptions.push({
    label: `الخدمة ${i}`,
    value: `service ${i}`,
    children: nestedServices,
  });
}

const editingPolicy =
  '<p  >في منصة "شغل أونلاين"، يمكن لمقدمي الخدمات تعديل خدماتهم، ولكن هناك بعض الإرشادات والقيود لضمان الجودة والتناسق على المنصة.</p><p  >فيما يلي سياسة تعديل الخدمة:</p><ol><li  >السماح بالتعديلات العامة<ul><li  >يمكن لمقدمي الخدمات تعديل العنوان، الوصف، التسعير، وغيرها من التفاصيل في أي وقت بعد نشر الخدمة.</li><li  >الفئة أو التصنيف: يمكن تغيير الفئة أو التصنيف إذا كانت الخدمة تناسب فئة أخرى بشكل أفضل.</li><li  >الوسائط الخاصة بالخدمة: يمكن تحديث الصور أو مقاطع الفيديو أو الملفات المتعلقة بالخدمة بشرط أن تتوافق مع معايير الجودة والمحتوى الخاصة بشغل أونلاين.</li><li  >الكلمات المفتاحية: يمكنك تعديل الكلمات المفتاحية لتحسين ظهور الخدمة في نتائج البحث.</li></ul></li><li  >&nbsp;القيود على التغييرات المتكررة أو الجذرية<ul><li  >التحديثات المتكررة: إجراء الكثير من التعديلات على الخدمة (خاصة بشكل متكرر) قد يؤدي إلى إزالة الخدمة مؤقتًا من نتائج البحث، حيث قد تحتاج إلى مراجعة من فريق شغل أونلاين.</li><li  >التغييرات الجذرية: تعديل الخدمة بشكل جذري (مثل تغيير نوع الخدمة أو الفئة بشكل كبير) قد يؤدي إلى إعادة مراجعة الخدمة من قبل فريق المراجعة للتحقق من الجودة والدقة.</li></ul></li><li  >المراجعة بعد التعديلات<ul><li  >قد تتطلب بعض التعديلات، خاصة تلك التي تشمل تغييرات في التسعير أو الفئات أو الوصف، إعادة مراجعة الخدمة من قبل فريق "شغل أونلاين".</li><li  >خلال فترة المراجعة، قد تختفي الخدمة مؤقتًا من نتائج البحث حتى تتم الموافقة عليها.</li></ul></li><li  >تأثير التعديلات على ترتيب الخدمة<ul><li  >التعديلات الكبيرة على العنوان أو الوصف أو الكلمات المفتاحية قد تؤثر على ترتيب الخدمة في نتائج البحث. تعتمد "شغل أونلاين" على خوارزميات البحث، لذلك فإن تغيير الكلمات المفتاحية يمكن أن يؤثر على ظهور خدمتك.</li></ul></li><li  >المخالفات والعقوبات<ul><li  >تعديل الخدمة لتتضمن محتوى محظورًا أو ينتهك شروط الخدمة في شغل أونلاين قد يؤدي إلى حذف الخدمة أو حتى تعليق حسابك.</li><li  >يجب على مقدمي الخدمات تجنب:<ul><li  >نسخ خدمات أخرى.</li><li  >إضافة كلمات مفتاحية غير ذات صلة.</li><li  >الأوصاف المضللة.</li><li  >إضافة روابط لمواقع خارجية (ما لم يكن مسموحًا بها بشكل صريح).</li></ul></li></ul></li><li  >التسعير ومدة التسليم<ul><li  >يمكنك تعديل التسعير ومدة التسليم وخيارات الباقات. ومع ذلك، عند تغيير الأسعار أو مدة التسليم، تأكد من أنها تتماشى مع ما هو موضح في وصف الخدمة لتجنب أي لبس بين المشترين.</li></ul></li><li  >تعديل الطلبات النشطة<ul><li  >لا يمكنك تعديل تفاصيل الخدمة أثناء وجود طلب قيد التنفيذ. سيتم الاحتفاظ بالشروط القديمة (السعر ومدة التسليم وغيرها) للطلب الحالي حتى يتم إكماله، وسيتم تطبيق التعديلات فقط على الطلبات المستقبلية.</li></ul></li></ol>';
export { skillsOptions, servicesOptions, editingPolicy };
